Test/src/Enums/ТипыДокументовЭДО/ТипыДокументовЭДО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыДокументовЭДО</name>
  <enumValues>
    <name>АктВзаимозачета</name>
  </enumValues>
  <enumValues>
    <name>АктВыполненныхРабот</name>
  </enumValues>
  <enumValues>
    <name>АктНаПередачуПрав</name>
  </enumValues>
  <enumValues>
    <name>АктОРасхождениях</name>
  </enumValues>
  <enumValues>
    <name>АктСверки</name>
  </enumValues>
  <enumValues>
    <name>АктСверкиВзаиморасчетов</name>
  </enumValues>
  <enumValues>
    <name>Ведомость</name>
  </enumValues>
  <enumValues>
    <name>Внутренний</name>
  </enumValues>
  <enumValues>
    <name>ВозвратТоваровМеждуОрганизациями</name>
  </enumValues>
  <enumValues>
    <name>ГарантийноеПисьмо</name>
  </enumValues>
  <enumValues>
    <name>Договор</name>
  </enumValues>
  <enumValues>
    <name>ДоговорныйДокумент</name>
  </enumValues>
  <enumValues>
    <name>ДокументПриемкиЕИСУКД</name>
    <comment>Титул поставщика из ЕИС</comment>
  </enumValues>
  <enumValues>
    <name>ДокументПриемкиЕИСУПД</name>
    <comment>Титул поставщика из ЕИС</comment>
  </enumValues>
  <enumValues>
    <name>ДополнительноеСоглашение</name>
  </enumValues>
  <enumValues>
    <name>ЗаказТовара</name>
  </enumValues>
  <enumValues>
    <name>ЗапросКоммерческихПредложений</name>
  </enumValues>
  <enumValues>
    <name>ИзвещениеОбОшибкеЕИС</name>
  </enumValues>
  <enumValues>
    <name>ИзвещениеОПолучении</name>
  </enumValues>
  <enumValues>
    <name>КаталогТоваров</name>
  </enumValues>
  <enumValues>
    <name>КвитанцияЕИС</name>
  </enumValues>
  <enumValues>
    <name>КоммерческоеПредложение</name>
  </enumValues>
  <enumValues>
    <name>КонтрактЕИС</name>
  </enumValues>
  <enumValues>
    <name>КорректировкаСведенийОЗакупкеКомиссионером</name>
  </enumValues>
  <enumValues>
    <name>КорректировкаСведенийОРеализацииКомиссионером</name>
  </enumValues>
  <enumValues>
    <name>КорректировочныйСчетФактура</name>
  </enumValues>
  <enumValues>
    <name>КС11</name>
  </enumValues>
  <enumValues>
    <name>КС2</name>
  </enumValues>
  <enumValues>
    <name>КС3</name>
  </enumValues>
  <enumValues>
    <name>МашиночитаемаяДоверенность</name>
  </enumValues>
  <enumValues>
    <name>ОтветНаЗаказ</name>
  </enumValues>
  <enumValues>
    <name>Отчет</name>
  </enumValues>
  <enumValues>
    <name>ОтчетОПродажахКомиссионногоТовара</name>
  </enumValues>
  <enumValues>
    <name>ОтчетОСписанииКомиссионногоТовара</name>
  </enumValues>
  <enumValues>
    <name>ПередачаТоваровМеждуОрганизациями</name>
  </enumValues>
  <enumValues>
    <name>ПлатежноеПоручение</name>
  </enumValues>
  <enumValues>
    <name>ПодтверждениеОператораЭДО</name>
  </enumValues>
  <enumValues>
    <name>ПрайсЛист</name>
  </enumValues>
  <enumValues>
    <name>ПредложениеОбАннулировании</name>
  </enumValues>
  <enumValues>
    <name>Прикладной</name>
  </enumValues>
  <enumValues>
    <name>ПриложениеДляЕИС</name>
  </enumValues>
  <enumValues>
    <name>ПриложениеКАкту</name>
  </enumValues>
  <enumValues>
    <name>Прочее</name>
  </enumValues>
  <enumValues>
    <name>РезультатРассмотренияАктаПриемкиЕИСУКД</name>
  </enumValues>
  <enumValues>
    <name>РезультатРассмотренияАктаПриемкиЕИСУПД</name>
  </enumValues>
  <enumValues>
    <name>РеквизитыОрганизации</name>
  </enumValues>
  <enumValues>
    <name>СведенияОЗакупкеКомиссионером</name>
  </enumValues>
  <enumValues>
    <name>СведенияОРеализацииКомиссионером</name>
  </enumValues>
  <enumValues>
    <name>СоглашениеОбИзмененииСтоимости</name>
  </enumValues>
  <enumValues>
    <name>СоглашениеОбЭДО</name>
  </enumValues>
  <enumValues>
    <name>Спецификация</name>
  </enumValues>
  <enumValues>
    <name>СчетНаОплату</name>
  </enumValues>
  <enumValues>
    <name>СчетФактура</name>
  </enumValues>
  <enumValues>
    <name>ТоварнаяНакладная</name>
  </enumValues>
  <enumValues>
    <name>Уведомление</name>
  </enumValues>
  <enumValues>
    <name>УведомлениеОбУточнении</name>
  </enumValues>
  <enumValues>
    <name>УведомлениеОПринятииКУчету</name>
  </enumValues>
  <enumValues>
    <name>УдалитьАктЗаказчик</name>
  </enumValues>
  <enumValues>
    <name>УдалитьАктИсполнитель</name>
  </enumValues>
  <enumValues>
    <name>УдалитьВыпискаБанка</name>
  </enumValues>
  <enumValues>
    <name>УдалитьДопДанные</name>
  </enumValues>
  <enumValues>
    <name>УдалитьЗапросВыписки</name>
  </enumValues>
  <enumValues>
    <name>УдалитьЗапросЗонд</name>
  </enumValues>
  <enumValues>
    <name>УдалитьЗапросНаОтзывЭД</name>
  </enumValues>
  <enumValues>
    <name>УдалитьЗапросНочнойВыписки</name>
  </enumValues>
  <enumValues>
    <name>УдалитьЗапросОСостоянииЭД</name>
  </enumValues>
  <enumValues>
    <name>УдалитьИзвещениеОСостоянииЭД</name>
  </enumValues>
  <enumValues>
    <name>УдалитьКвитанция</name>
  </enumValues>
  <enumValues>
    <name>УдалитьОшибка</name>
  </enumValues>
  <enumValues>
    <name>УдалитьПлатежноеПоручение</name>
  </enumValues>
  <enumValues>
    <name>УдалитьПлатежноеТребование</name>
  </enumValues>
  <enumValues>
    <name>УдалитьПроизвольный</name>
  </enumValues>
  <enumValues>
    <name>УдалитьСоглашениеОбИзмененииСтоимостиПолучатель</name>
  </enumValues>
  <enumValues>
    <name>УдалитьТОРГ12</name>
  </enumValues>
  <enumValues>
    <name>УдалитьТОРГ12Покупатель</name>
  </enumValues>
  <enumValues>
    <name>УдалитьУКД_ИнформацияПокупателя</name>
  </enumValues>
  <enumValues>
    <name>УдалитьУКД_ИнформацияПродавца</name>
  </enumValues>
  <enumValues>
    <name>УдалитьУПД_ИнформацияПокупателя</name>
  </enumValues>
  <enumValues>
    <name>УдалитьУПД_ИнформацияПродавца</name>
  </enumValues>
  <enumValues>
    <name>УКД</name>
  </enumValues>
  <enumValues>
    <name>УПД</name>
  </enumValues>
  <enumValues>
    <name>ЭЗН</name>
  </enumValues>
  <enumValues>
    <name>ЭСВ</name>
  </enumValues>
  <enumValues>
    <name>ЭЗЗ</name>
  </enumValues>
  <enumValues>
    <name>АктПриемкиСтроительныхРаботУслуг</name>
  </enumValues>
  <enumValues>
    <name>ЭТрН</name>
  </enumValues>
  <enumValues>
    <name>ЭПЛ</name>
  </enumValues>
  <enumValues>
    <name>ЭДФ</name>
  </enumValues>
</mdclass:Enum>

Test/src/CommonModules/СервисВзаимодействияМПЭПДКлиентСервер/Module.bsl
#Область СлужебныйПрограммныйИнтерфейс

Функция ПредставлениеПустогоЗначенияДанныхМП() Экспорт
	
	Возврат "<не заполнено>";
	
КонецФункции

Функция ТипДокументаМП(ДокументЭПД) Экспорт
	
	Результат = "";
	
	Если ТипЗнч(ДокументЭПД) = Тип("ДокументСсылка.ЭлектроннаяТранспортнаяНакладная")
		Или ДокументЭПД = ПредопределенноеЗначение("Перечисление.ТипыДокументовЭДО.ЭТрН") Тогда
		Результат = "ETRN";
	ИначеЕсли ТипЗнч(ДокументЭПД) = Тип("ДокументСсылка.ЭлектронныйПутевойЛист")
		Или ДокументЭПД = ПредопределенноеЗначение("Перечисление.ТипыДокументовЭДО.ЭПЛ") Тогда
		Результат = "EPL"; 
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ТитулПоддерживаетсяМобильнымПриложением(ПрефиксТитула) Экспорт
	
	Возврат ПрефиксТитула = "ТитулПеревозчикаПриемка"
		Или ПрефиксТитула = "ТитулПеревозчикаВыдача";
	
КонецФункции

Функция АтомарныеРолиМП() Экспорт
	
	Результат = Новый Массив;
	
	//@skip-check typed-value-adding-to-untyped-collection
	Результат.Добавить(НСтр("ru='Оформитель'"));
	//@skip-check typed-value-adding-to-untyped-collection
	Результат.Добавить(НСтр("ru='Медработник'"));
	//@skip-check typed-value-adding-to-untyped-collection
	Результат.Добавить(НСтр("ru='Механик'"));
	//@skip-check typed-value-adding-to-untyped-collection
	Результат.Добавить(НСтр("ru='Ответственный за показания одометра'"));
	//@skip-check typed-value-adding-to-untyped-collection
	Результат.Добавить(НСтр("ru='Водитель'"));
	
	Возврат Результат;
	
КонецФункции

Функция ПредставленияРолейМП(Все = Истина, Отбор = Неопределено) Экспорт
	
	Результат = Новый Соответствие;
	
	АтомарныеРоли = АтомарныеРолиМП();
	
	ВсегоРолей = АтомарныеРоли.Количество();
	
	РолиПоддерживаемыеМП = РолиПоддерживаемыеМП();
	
	Если Все = Истина Тогда
		Для СчетчикОбщий = 1 По Pow(2, ВсегоРолей) - 1 Цикл
			СчетчикАтомарный = 0;	
			ПредставлениеМассив = Новый Массив;
			СоответствуетОтбору = Истина;
			Для Каждого Роль Из АтомарныеРоли Цикл
				Если РолиПоддерживаемыеМП.Найти(СчетчикАтомарный) <> Неопределено Тогда				
					РольЧисловая = Pow(2, СчетчикАтомарный);
					Если ОбменСГИСЭПДКлиентСервер.ВхождениеРоли(СчетчикОбщий, РольЧисловая, ВсегоРолей) Тогда
						//@skip-check typed-value-adding-to-untyped-collection
						ПредставлениеМассив.Добавить(Роль);
						Если Отбор <> Неопределено И СчетчикАтомарный <> Отбор Тогда
							СоответствуетОтбору = Ложь;	
						КонецЕсли;	
					КонецЕсли;	
				КонецЕсли;
				СчетчикАтомарный = СчетчикАтомарный + 1;
			КонецЦикла;	
			Если СоответствуетОтбору = Истина И ПредставлениеМассив.Количество() > 0 Тогда
				Результат.Вставить(СчетчикОбщий, СтрСоединить(ПредставлениеМассив, ", "));
			КонецЕсли;
		КонецЦикла;
	Иначе
		СчетчикАтомарный = 0;
		Для Каждого Роль Из АтомарныеРоли Цикл		
			Если РолиПоддерживаемыеМП.Найти(СчетчикАтомарный) <> Неопределено
				И (Отбор = Неопределено Или СчетчикАтомарный = Отбор) Тогда
				РольЧисловая = Pow(2, СчетчикАтомарный);
				Результат.Вставить(РольЧисловая, Роль);
			КонецЕсли;
			СчетчикАтомарный = СчетчикАтомарный + 1;
		КонецЦикла;	
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ИнформацияПоТитулуМП(ДокументСсылка, РольУчастника) Экспорт
	
	Если ТипЗнч(ДокументСсылка) = Тип("ДокументСсылка.ЭлектроннаяТранспортнаяНакладная") И РольУчастника = 1 Тогда
		Результат = Новый Структура;
		Результат.Вставить("ЗаголовокПолей", "По данным водителя");
		
		СобытияПривязки = Новый Массив;
		СобытияПривязки.Добавить(ПредопределенноеЗначение("Перечисление.ТипыВзаимодействияМПЭПД.ПривязкаВодителя")); 
		
		Результат.Вставить("СобытияПривязки", СобытияПривязки);
		
		Возврат Результат;	
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

Функция КартинкаПустаяФотография() Экспорт
	
	Возврат БиблиотекаКартинок.ПустаяФотографияЭПД.ПолучитьДвоичныеДанные();
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Возвращает индексы поддерщиваемых МП ролей пользователя по массиву, возвращаемого методом АтомарныеРолиМП
Функция РолиПоддерживаемыеМП()
	
	Результат = Новый Массив;
	
	Если ДокументПоддерживаетсяМП(ПредопределенноеЗначение("Перечисление.ТипыДокументовЭДО.ЭПЛ")) = Истина Тогда
		//@skip-check typed-value-adding-to-untyped-collection
		Результат.Добавить(1);
		//@skip-check typed-value-adding-to-untyped-collection
		Результат.Добавить(2);
		//@skip-check typed-value-adding-to-untyped-collection
		Результат.Добавить(3);
	Иначе
		//@skip-check typed-value-adding-to-untyped-collection
		Результат.Добавить(4);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ДокументПоддерживаетсяМП(ДокументЭПД)
	
	Результат = Ложь;
	
	Если ТипЗнч(ДокументЭПД) = Тип("ДокументСсылка.ЭлектроннаяТранспортнаяНакладная")
		Или ДокументЭПД = ПредопределенноеЗначение("Перечисление.ТипыДокументовЭДО.ЭТрН") Тогда
		Результат = Истина;
	ИначеЕсли ТипЗнч(ДокументЭПД) = Тип("ДокументСсылка.ЭлектронныйПутевойЛист")
		Или ДокументЭПД = ПредопределенноеЗначение("Перечисление.ТипыДокументовЭДО.ЭПЛ") Тогда
		Результат = Ложь; 
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти
